Repository: OolaaPleur/Yggert-nu
Catalog: lib/l10n/intl_*.arb
Languages: et, ru

# settingsAppBarTitle
source: Settings
et: Seaded
ru: Настройки

# settingsGlobalFilterAll
source: Show all
et: Näita kõiki
ru: Показать все

# settingsGlobalFilterToday
source: Show for today
et: Näita tänaseid
ru: Показать на сегодня

# settingsChangeTheme
source: Change theme
et: Muuda teemat
ru: Сменить тему

# settingsNoGtfsFile
source: No GTFS file
et: GTFS-faili pole
ru: GTFS файлы не найдены

# settingsGtfsFileWasDownloaded
source: GTFS file was downloaded
et: GTFS-fail on allalaaditud
ru: Файл GTFS был загружен

# settingsLocalFilterAll
source: All
et: Kõik
ru: Все

# settingsLocalFilterToday
source: Today
et: Täna
ru: Сегодня

source: Tallinn
ru: Таллинн

source: Haapsalu
ru: Хаапсалу

source: Tartu
ru: Тарту

# johvi
source: Jõhvi
ru: Йыхви

# kohtlaJarve
source: Kohtla-Järve
ru: Кохтла-Ярве

source: Kuressaare
ru: Курессааре

source: Narva
ru: Нарва

# parnu
source: Pärnu
ru: Пярну

source: Rakvere
ru: Раквере

source: Viljandi
ru: Вильянди

# voru
source: Võru
ru: Выру

# homeScooterFAB
source: Scooters filter
et: Tõukerataste filter
ru: Фильтр самокатов

# homeBikeFAB
source: Bike filter
et: Jalgrattafilter
ru: Фильтр велосипедов

# homeStopFAB
source: Stop filter
et: Peatuse filter
ru: Фильтр остановок

# homeAppBarSettingsIcon
source: Settings
et: Seaded
ru: Настройки

# homeAppBarRefreshIcon
source: Refresh
et: Värskenda
ru: Обновить

# snackbarNoNeedToDownload
source: You have the latest GTFS data.
et: Teil on uusimad GTFS andmed.
ru: У вас самые свежие GTFS данные.

# snackbarCantFetchBoltScootersData
source: Server error. Cant fetch Bolt scooters data.
et: Serveri viga. Ei saa laadida Bolti tõukerataste andmeid.
ru: Ошибка сервера. Невозможно загрузить данные о Bolt самокатах.

# snackbarCantFetchTuulScootersData
source: Server error. Cant fetch Tuul scooters data.
et: Serveri viga. Ei saa laadida Tuul tõukerataste andmeid.
ru: Ошибка сервера. Невозможно загрузить данные о Tuul самокатах.

# snackbarCantFetchTartuSmartBikeData
source: Server error. Cant fetch Tartu Smart bike data.
et: Serveri viga. Ei saa laadida Tartu Smart bike andmeid.
ru: Ошибка сервера. Невозможно загрузить данные о велосипедах Tartu Smart bike.

# snackbarNoInternetConnection
source: No Internet connection. Please check your connection, press refresh button and try again.
et: Internetiühendus puudub. Palun kontrollige oma ühendust, klõpsake värskendamise nuppu ja proovige uuesti.
ru: Нет интернет-соединения. Пожалуйста проверьте его, нажмите на иконку 'Обновить' и попробуйте снова.

# snackbarNoInternetConnectionInSettings
source: No Internet connection. Please check your connection and try again.
et: Internetiühendus puudub. Palun kontrollige oma ühendust ja proovige uuesti.
ru: Нет интернет-соединения. Пожалуйста проверьте его и попробуйте снова.

# snackbarDeviceIsNotSupported
source: Device is not supported.
et: Seade ei ole toetatud.
ru: Устройство не поддерживается.

# snackbarCityIsNotPicked
source: No city was picked.
et: Ühtegi linna ei valitud.
ru: Город не выбран

# snackbarNoGtfsFileIsPresent
source: No file is present, press refresh button to download.
et: Faili pole, vajutage allalaadimiseks värskendusnuppu.
ru: GTFS файлов нет, нажмите кнопку обновить для загрузки.

# mapScreenGpsFAB
source: Get geolocation
et: Hangi geolokatsioon
ru: Получить геолокацию

# stopMarkerShowAllForwardStoptimesButton
source: Press to see stoptimes
et: Vajuta, et näha peatuse aegu
ru: Показать остановки

# settingsLanguageRussian
source: Russian
et: Vene keel
ru: Русский

# settingsLanguageEnglish
source: English
et: Inglise keel
ru: Английский

# someErrorOccurred
source: Some error occurred. Please try again later.
et: Ilmnes viga. Palun proovige hiljem uuesti.
ru: Произошла неизвестная ошибка. Попробуйте снова позже.

# geolocationPermissionDenied
source: Permission denied, you cannot see your location on map.
et: Luba keelatud, te ei saa kaardil oma asukohta näha.
ru: Нет разрешения на геолокацию, вы не можете увидеть свое местоположение.

# microMobilityCouldNotLoad
source: Could not load required info.
et: Ei saanud vajalikku infot laadida.
ru: Не получилось загрузить нужную информацию.

# modalBottomSheetScooterCharge
source: Battery Charge: {charge}%
et: Aku laetuse tase: {charge}%
ru: Заряд батареи: {charge}%

# modalBottomSheetScooterPrice
source: Price: {price}
et: Hind: {price}/min
ru: Цена: {price}/мин

# modalBottomSheetScooterStartPrice
source: Start price: {price}
et: Start hind: {price}
ru: Старт: {price}

# modalBottomSheetScooterReservePrice
source: Reserve {price}/min
et: Broneeri {price}/min
ru: Бронирование: {price}/мин

# modalBottomSheetScooterGoToApp
source: Go to {app} app
et: Mine {app} rakendusse
ru: Перейти в {app}

# modalBottomSheetTartuBikesPedelecCount
source: Pedelec Bikes: {count}
et: Pedelec jalgrattad: {count}
ru: Электрических: {count}

# modalBottomSheetTartuBikesBikeCount
source: Bikes: {count}
et: Jalgrattad: {count}
ru: Велосипедов: {count}

# stopSearchHintText
source: Enter stop name.
et: Sisesta peatuse nimi.
ru: Введите название остановки.

source: Mon
et: Esm
ru: Пн

source: Tue
et: Tei
ru: Вт

source: Wed
et: Kol
ru: Ср

source: Thu
et: Nel
ru: Чт

source: Fri
et: Ree
ru: Пт

source: Sat
et: Lau
ru: Сб

source: Sun
et: Püh
ru: Вс

source: Sign in with Google
et: Logi sisse Google'iga
ru: Войти через Google

# changeCity
source: Pick a city
et: Vali linn
ru: Выбери город

source: Change language
et: Muuda keelt
ru: Выбери язык

source: Change filter
et: Muuda filtrit
ru: Выбери фильтр

# settingsLanguageEstonian
source: Estonian
et: Eesti keel
ru: Эстонский

# introFirstScreenHeader
source: Welcome to the Yggert Nu!
et: Tere tulemast Yggert Nu!
ru: Добро пожаловать в Yggert Nu!

# introFirstScreenBody
source: Experience a revolution in urban mobility. Seamlessly integrate your travel with rental scooters, bikes, cars, and public transport all in one app.
et: Koge linna liikuvuse revolutsiooni. Ühenda oma reisid renditavate tõukerataste, jalgrataste, autode ja ühistranspordiga ühes rakenduses.
ru: Испытайте революцию в городской мобильности. Интегрируйте свои путешествия с арендой скутеров, велосипедов, автомобилей и общественного транспорта, все в одном приложении.

# introSecondScreenHeader
source: All Your Transport Options in One Place
et: Kõik Sinu transpordivõimalused ühes kohas
ru: Все Ваши варианты транспорта в одном месте

# introSecondScreenBody
source: Find the fastest and most convenient mode of transportation tailored to your needs. All available rentals and public transit options are integrated onto one convenient map.
et: Leia enda vajadustele kõige kiirem ja mugavam transport. Kõik saadaolevad renditeenused ja ühistranspordi valikud on integreeritud ühele mugavale kaardile.
ru: Найдите самый быстрый и удобный способ передвижения, подходящий именно Вам. Все доступные арендные услуги и варианты общественного транспорта интегрированы на одной удобной карте.

# introSecondAndHalfScreenHeader
source: Unified Transport Services
et: Ühendatud transporditeenused
ru: Унифицированные транспортные услуги

# introSecondAndHalfScreenBody
source: Please note, Yggert Nu aggregates data from various transport apps, and rental bookings are made through the respective provider's app which will need to be installed on your device.
et: Palun pange tähele, et Yggert Nu koondab andmeid erinevatest transpordirakendustest ning rentimisbroneeringud tehakse vastava teenusepakkuja rakenduse kaudu, mis peab olema teie seadmesse installitud.
ru: Обратите внимание, что Yggert Nu агрегирует данные из различных транспортных приложений, и бронирование происходит через приложение соответствующего поставщика, которое должно быть установлено на вашем устройстве.

# introThirdScreenHeader
source: Always Be on Time
et: Ole alati õigeaegselt kohal
ru: Всегда будьте вовремя

# introThirdScreenBody
source: Never miss a bus again. Check the local bus stops for upcoming schedules and arrivals when no immediate transportation is nearby.
et: Ära jäta enam kunagi bussi maha. Kontrolli kohalikke bussipeatusi järgmiste ajakavade ja saabumiste kohta, kui läheduses pole otsest transporti.
ru: Больше никогда не пропустите автобус. Проверьте местные автобусные остановки для просмотра ближайших расписаний и прибытий, когда рядом нет непосредственного транспорта.

# introFourthScreenHeader
source: Customize to Your Liking
et: Kohanda oma soovide järgi
ru: Настройте по своему вкусу

# introFourthScreenBody
source: Choose your preferred city, switch between light or dark theme, and select your language. Personalize your experience with our easily accessible settings.
et: Vali oma eelistatud linn, lülita valguse või pimeduse teema vahel ning vali keel. Kohanda oma kogemust meie lihtsasti ligipääsetavate seadistustega.
ru: Выберите свой предпочитаемый город, переключите тему на светлую или темную, выберите свой язык. Настройте свой опыт с помощью наших легко доступных настроек.

# introFifthScreenHeader
source: Save Your Preferences
et: Salvesta oma eelistused
ru: Сохраните свои предпочтения

# introFifthScreenBody
source: Sign in using your Google account. Your preferences are saved to provide a consistent, personalized experience every time you use Yggert Nu.
et: Logi sisse oma Google'i kontoga. Sinu eelistused salvestatakse, et pakkuda järjepidevat, personaalset kogemust iga kord, kui kasutad Yggert Nu-d.
ru: Войдите в систему с помощью своей учетной записи Google. Ваши предпочтения сохраняются для обеспечения последовательного, персонализированного опыта каждый раз, когда вы используете Yggert Nu.

# introSixthScreenHeader
source: Ready for the Journey?
et: Valmis reisiks?
ru: Готовы к путешествию?

# introSixthScreenBody
source: Welcome to a smarter, more integrated world of transport. Start your journey with Yggert Nu now!
et: Tere tulemast nutikamasse, paremini integreeritud transpordimaailma. Alusta oma teekonda Yggert Nu-ga nüüd!
ru: Добро пожаловать в более умный, более интегрированный мир транспорта. Начните свое путешествие с Yggert Nu сейчас!

# doneButtonText
source: Done
et: Valmis
ru: Готово

# onboardingTitleTextCity
source: Picked city
et: Valitud linn
ru: Выбранный город

# onboardingBodyTextCity
source: City for which data is loaded
et: Linn, mille andmed on laaditud
ru: Город, для которого загружены данные

# onboardingBodyTextCustomize
source: Tap to customize map settings
et: Koputage kaardi seadete kohandamiseks
ru: Нажмите, чтобы настроить настройки карты

# onboardingBodyTextRefresh
source: Tap to refresh markers
et: Koputage markerite värskendamiseks
ru: Нажмите, чтобы обновить маркеры

# onboardingTitleTextFilters
source: Use filters
et: Kasutage filtreid
ru: Используйте фильтры

# onboardingBodyTextFiltersExample
source: For example this button shows/hides scooters
et: Näiteks see nupp näitab/peidab rollerid
ru: Например, эта кнопка показывает/скрывает скутеры

# onboardingTitleTextGoodLuck
source: Good luck on the road!
et: Edu teel!
ru: Удачи на дороге!

# showScootersLowerCharge
source: Show scooters with charge lower than 30%?
et: Näita tõukerattad, mille laadimisjõud on alla 30%?
ru: Показывать самокаты с зарядом меньше 30%?

# yesButton
source: Yes
et: Jah
ru: Да

# noButton
source: No
et: Ei
ru: Нет

source: Start tutorial again?
et: Alusta õpetust uuesti?
ru: Начать обучение снова?

source: Are you sure?
et: Oled sa kindel?
ru: Вы уверены?

source: User data downloaded successfully
et: Kasutaja andmed on edukalt allalaaditud
ru: Данные пользователя успешно загружены

source: User data uploaded successfully
et: Kasutaja andmed on edukalt üles laaditud
ru: Данные пользователя успешно загружены
